lelebrr/Esp32-S3/src/core/sd_functions.cpp
    File root = fs.open(folder);
    if (!root || !root.isDirectory()) { return; }

    while (true) {
        bool isDir;
        String fullPath = root.getNextFileName(&isDir);
        String nameOnly = fullPath.substring(fullPath.lastIndexOf("/") + 1);
        if (fullPath == "") { break; }
        // Serial.printf("Path: %s (isDir: %d)\n", fullPath.c_str(), isDir);

        if (isDir) {
            object.filename = nameOnly;
            object.folder = true;
            object.operation = false;
            fileList.push_back(object);
        } else {
            int dotIndex = nameOnly.lastIndexOf(".");
            String ext = dotIndex >= 0 ? nameOnly.substring(dotIndex + 1) : "";
            if (allowed_ext == "*" || checkExt(ext, allowed_ext)) {
                object.filename = nameOnly;
                object.folder = false;
                object.operation = false;
                fileList.push_back(object);
            }
        }
    }
    root.close();

    // Sort folders/files
    std::sort(fileList.begin(), fileList.end(), sortList);

    LOG_INFO("Files listed with: %d files/folders found", fileList.size());

    // Adds Operational btn at the botton
    object.filename = "> Back";
    object.folder = false;
    object.operation = true;

    fileList.push_back(object);
}

/*********************************************************************
**  Function: loopSD
**  Where you choose what to do with your SD Files
**********************************************************************/
String loopSD(FS &fs, bool filePicker, String allowed_ext, String rootPath) {
    delay(10);
    if (!fs.exists(rootPath)) {
        LOG_WARN("loopSD-> 1st exist test failed");
        rootPath = "/";
        if (!fs.exists(rootPath)) {
            LOG_WARN("loopSD-> 2nd exist test failed");
            if (&fs == &SD) sdcardMounted = false;
            return "";
        }
    }

    Opt_Coord coord;
    String result = "";
    const short PAGE_JUMP_SIZE = (tftHeight - 20) / (LH * FM);
    bool reload = false;
    bool redraw = true;
    int index = 0;
    int maxFiles = 0;
    String Folder = rootPath;
    String PreFolder = rootPath;
    tft.drawPixel(0, 0, 0);
    tft.fillScreen(leleConfig.bgColor); // TODO: Does only the T-Embed CC1101 need this?
    tft.drawRoundRect(5, 5, tftWidth - 10, tftHeight - 10, 5, leleConfig.priColor);
    if (&fs == &SD) {
        if (!setupSdCard()) {
            displayError("Fail Mounting SD", true);
            return "";
        }
    }
    bool exit = false;
    // returnToMenu=true;  // make sure menu is redrawn when quitting in any point

    readFs(fs, Folder, allowed_ext);

    maxFiles = fileList.size() - 1; // discount the >back operator
    LongPress = false;
    unsigned long LongPressTmp = millis();
    while (1) {
        delay(10);
        // if(returnToMenu) break; // stop this loop and retur to the previous loop
        if (exit) break; // stop this loop and retur to the previous loop

        if (redraw) {
            if (strcmp(PreFolder.c_str(), Folder.c_str()) != 0 || reload) {
                index = 0;
                tft.fillScreen(leleConfig.bgColor);
                tft.drawRoundRect(5, 5, tftWidth - 10, tftHeight - 10, 5, leleConfig.priColor);
                LOG_DEBUG("reload to read: %s", Folder.c_str());
                readFs(fs, Folder, allowed_ext);
                PreFolder = Folder;
                maxFiles = fileList.size() - 1;
                if (strcmp(PreFolder.c_str(), Folder.c_str()) != 0 || index > maxFiles) index = 0;
                reload = false;
            }
            if (fileList.size() < 2) readFs(fs, Folder, allowed_ext);

            coord = listFiles(index, fileList);
#if defined(HAS_TOUCH)
            TouchFooter();
#endif
            redraw = false;
        }
        displayScrollingText(fileList[index].filename, coord);

#ifdef HAS_KEYBOARD
        char pressed_letter = checkLetterShortcutPress();
        if (check(EscPress)) goto BACK_FOLDER; // quit

        // check letter shortcuts
        if (pressed_letter > 0) {
            // Serial.println(pressed_letter);
            if (tolower(fileList[index].filename.c_str()[0]) == pressed_letter) {
                // already selected, go to the next
                index += 1;
                // check if index is still valid
                if (index <= maxFiles && tolower(fileList[index].filename.c_str()[0]) == pressed_letter) {
                    redraw = true;
                    continue;
                }
            }
            // else look again from the start
            for (int i = 0; i < maxFiles; i++) {
                if (tolower(fileList[i].filename.c_str()[0]) == pressed_letter) { // check if 1st char matches
                    index = i;
                    redraw = true;
                    break; // quit on 1st match
                }
            }
        }
#elif defined(T_EMBED) || defined(HAS_TOUCH) || !defined(HAS_SCREEN)
        if (check(EscPress)) goto BACK_FOLDER;
#endif

        if (check(PrevPress) || check(UpPress)) {
            if (index == 0) index = maxFiles;
            else if (index > 0) index--;
            redraw = true;
        }
        /* DW Btn to next item */
        if (check(NextPress) || check(DownPress)) {
            if (index == maxFiles) index = 0;
            else index++;
            redraw = true;
        }
        if (check(NextPagePress)) {
            index += PAGE_JUMP_SIZE;
            if (index > maxFiles) index = maxFiles - 1; // check bounds
            redraw = true;
            continue;
        }
        if (check(PrevPagePress)) {
            index -= PAGE_JUMP_SIZE;
            if (index < 0) index = 0; // check bounds
            redraw = true;
            continue;
        }
        /* Select to install */
        if (LongPress || SelPress) {
            if (!LongPress) {
                LongPress = true;
                LongPressTmp = millis();
            }
            if (LongPress && millis() - LongPressTmp < 500) goto WAITING;
            LongPress = false;

