lelebrr/Esp32-S3/src/core/sd_functions.cpp
            if (check(SelPress)) {
                if (fileList[index].folder == true && fileList[index].operation == false) {
                    options = {
                        {"New Folder",     [=]() { createFolder(fs, Folder); }                                 },
                        {"Renomear",
                         [=]() {
                             renameFile(fs, Folder + fileList[index].filename, fileList[index].filename);
                         }                                                                                     },
                        {"Excluir",        [=]() { deleteFromSd(fs, Folder + "/" + fileList[index].filename); }},
                        {"Close Menu",     [&]() { yield(); }                                                  },
                        {"Menu Principal", [&]() { exit = true; }                                              },
                    };
                    loopOptions(options);
                    tft.drawRoundRect(5, 5, tftWidth - 10, tftHeight - 10, 5, leleConfig.priColor);
                    reload = true;
                    redraw = true;
                } else if (fileList[index].folder == false && fileList[index].operation == false) {
                    goto Files;
                } else {
                    options = {
                        {"New Folder", [=]() { createFolder(fs, Folder); }},
                    };
                    if (fileToCopy != "") options.push_back({"Colar", [=]() { pasteFile(fs, Folder); }});
                    options.push_back({"Close Menu", [&]() { yield(); }});
                    options.push_back({"Menu Principal", [&]() { exit = true; }});
                    loopOptions(options);
                    tft.drawRoundRect(5, 5, tftWidth - 10, tftHeight - 10, 5, leleConfig.priColor);
                    reload = true;
                    redraw = true;
                }
            } else {
            Files:
                if (fileList[index].folder == true && fileList[index].operation == false) {
                    Folder = Folder + (Folder == "/" ? "" : "/") +
                             fileList[index].filename; // Folder=="/"? "":"/" +
                    // Debug viewer
                    LOG_DEBUG("Folder: %s", Folder.c_str());
                    redraw = true;
                } else if (fileList[index].folder == false && fileList[index].operation == false) {
                    // Save the file/folder info to Clear memory to allow other functions to work better
                    String filepath = Folder + (Folder == "/" ? "" : "/") + fileList[index].filename; //
                    String filename = fileList[index].filename;
                    // Debug viewer
                    LOG_DEBUG("%s --> %s", filepath.c_str(), filename.c_str());
                    fileList.clear(); // Clear memory to allow other functions to work better

                    options = {
                        {"View File",  [=]() { viewFile(fs, filepath); }            },
                        {"File Info",  [=]() { fileInfo(fs, filepath); }            },
                        {"Renomear",   [=]() { renameFile(fs, filepath, filename); }},
                        {"Copiar",     [=]() { copyFile(fs, filepath); }            },
                        {"Excluir",    [=]() { deleteFromSd(fs, filepath); }        },
                        {"New Folder", [=]() { createFolder(fs, Folder); }          },
                    };
                    if (fileToCopy != "") options.push_back({"Colar", [=]() { pasteFile(fs, Folder); }});
                    if (&fs == &SD)
                        options.push_back({"Copy->LittleFS", [=]() { copyToFs(SD, LittleFS, filepath); }});
                    if (&fs == &LittleFS && sdcardMounted)
                        options.push_back({"Copy->SD", [=]() { copyToFs(LittleFS, SD, filepath); }});

                    // custom file formats commands added in front
                    if (filepath.endsWith(".jpg") || filepath.endsWith(".gif") || filepath.endsWith(".bmp") ||
                        filepath.endsWith(".png"))
                        options.insert(options.begin(), {"View Image", [&]() {
                                                             drawImg(fs, filepath, 0, 0, true, -1);
                                                             delay(750);
                                                             while (!check(AnyKeyPress))
                                                                 vTaskDelay(10 / portTICK_PERIOD_MS);
                                                         }});
                    if (filepath.endsWith(".ir"))
                        options.insert(options.begin(), {"IR Tx SpamAll", [&]() {
                                                             delay(200);
                                                             txIrFile(&fs, filepath);
                                                         }});
                    if (filepath.endsWith(".sub"))
                        options.insert(options.begin(), {"Subghz Tx", [&]() {
                                                             delay(200);
                                                             txSubFile(&fs, filepath);
                                                         }});
                    if (filepath.endsWith(".csv")) {
                        options.insert(options.begin(), {"Wigle Upload", [&]() {
                                                             delay(200);
                                                             Wigle wigle;
                                                             wigle.upload(&fs, filepath);
                                                         }});
                        options.insert(options.begin(), {"Wigle Up All", [&]() {
                                                             delay(200);
                                                             Wigle wigle;
                                                             wigle.upload_all(&fs, Folder);
                                                         }});
                    }
#if !defined(LITE_VERSION) && !defined(DISABLE_INTERPRETER)
                    if (filepath.endsWith(".bjs") || filepath.endsWith(".js")) {
                        options.insert(options.begin(), {"JS Script Run", [&]() {
                                                             delay(200);
                                                             run_bjs_script_headless(fs, filepath);
                                                             exit = true;
                                                         }});
                    }
#endif
#if defined(USB_as_HID)
                    if (filepath.endsWith(".txt")) {
                        options.push_back({"BadUSB Run", [&]() {
                                               ducky_startKb(hid_usb, false);
                                               key_input(fs, filepath, hid_usb);
                                               delete hid_usb;
                                               hid_usb = nullptr;
                                               // TODO: reinit serial port
                                           }});
                        options.push_back({"USB HID Type", [&]() {
                                               String t = readSmallFile(fs, filepath);
                                               displayRedStripe("Typing");
                                               key_input_from_string(t);
                                           }});
                    }
                    if (filepath.endsWith(".enc")) { // encrypted files
                        options.insert(
                            options.begin(), {"Decrypt+Type", [&]() {
                                                  String plaintext = readDecryptedFile(fs, filepath);
                                                  if (plaintext.length() == 0)
                                                      return displayError(
                                                          "Decryption failed", true
                                                      ); // file is too big or cannot read, or cancelled
                                                  // else
                                                  plaintext.trim(); // remove newlines
                                                  key_input_from_string(plaintext);
                                              }}
                        );
                    }
#endif
                    if (filepath.endsWith(".enc")) { // encrypted files
                        options.insert(
                            options.begin(), {"Decrypt+Show", [&]() {
                                                  String plaintext = readDecryptedFile(fs, filepath);
                                                  delay(200);
                                                  if (plaintext.length() == 0)
                                                      return displayError("Decryption failed", true);
                                                  plaintext.trim(); // remove newlines
                                                                    // if(plaintext.length()<..)
                                                  displaySuccess(plaintext, true);
                                                  // else
                                                  // TODO: show in the text viewer
                                              }}
                        );
                    }
#if defined(HAS_NS4168_SPKR)
                    if (isAudioFile(filepath))
                        options.insert(options.begin(), {"Play Audio", [&]() {
                                                             delay(200);
                                                             check(AnyKeyPress);
                                                             playAudioFile(&fs, filepath);
                                                         }});
#endif
                    // generate qr codes from small files (<3K)
                    size_t filesize = getFileSize(fs, filepath);
                    // Serial.println(filesize);
                    if (filesize < SAFE_STACK_BUFFER_SIZE && filesize > 0) {
                        options.push_back({"QR code", [&]() {
                                               delay(200);
                                               qrcode_display(readSmallFile(fs, filepath));
                                           }});
                        options.push_back({"CRC32", [&]() {
                                               delay(200);
                                               displaySuccess(crc32File(fs, filepath), true);
                                           }});
                        options.push_back({"MD5", [&]() {
                                               delay(200);
                                               displaySuccess(md5File(fs, filepath), true);
                                           }});
                    }
                    options.push_back({"Close Menu", [&]() { yield(); }});
                    options.push_back({"Menu Principal", [&]() { exit = true; }});
                    if (!filePicker) loopOptions(options);
                    else {
                        result = filepath;
                        break;
                    }
                    tft.drawRoundRect(5, 5, tftWidth - 10, tftHeight - 10, 5, leleConfig.priColor);
                    reload = true;
                    redraw = true;
                } else {
                BACK_FOLDER:
                    if (Folder == "/") break;
                    Folder = Folder.substring(0, Folder.lastIndexOf('/'));
                    if (Folder == "") Folder = "/";
                    Serial.println("Going to folder: " + Folder);
                    index = 0;
                    redraw = true;
                }
                redraw = true;
            }
        WAITING:
            delay(10);
        }
    }
    fileList.clear();
    return result;
}

/*********************************************************************
**  Function: viewFile
**  Display file content
**********************************************************************/
void viewFile(FS fs, String filepath) {
    File file = fs.open(filepath, FILE_READ);
    if (!file) return;

    ScrollableTextArea area = ScrollableTextArea("VIEW FILE");
    area.fromFile(file);

    file.close();

    area.show();
}

/*********************************************************************
**  Function: checkLittleFsSize
**  Check if there are more then 4096 bytes available for storage
**********************************************************************/
bool checkLittleFsSize() {
    if ((LittleFS.totalBytes() - LittleFS.usedBytes()) < 4096) {
        displayError("LittleFS is Full", true);
        return false;
    } else return true;
}

/*********************************************************************
**  Function: checkLittleFsSize
**  Check if there are more then 4096 bytes available for storage
**********************************************************************/
bool checkLittleFsSizeNM() { return (LittleFS.totalBytes() - LittleFS.usedBytes()) >= 4096; }

/*********************************************************************
**  Function: getFsStorage
**  Function will return true and FS will point to SDFS if available
**  and LittleFS otherwise. If LittleFS is full it wil return false.
**********************************************************************/
bool getFsStorage(FS *&fs) {
    if (setupSdCard()) fs = &SD;
    else if (checkLittleFsSize()) fs = &LittleFS;
    else return false;

