lelebrr/Esp32-S3/src/core/sd_functions.cpp
    return true;
}

/*********************************************************************
**  Function: fileInfo
**  Display file info
**********************************************************************/
void fileInfo(FS fs, String filepath) {
    File file = fs.open(filepath, FILE_READ);
    if (!file) return;

    int bytesize = file.size();
    float filesize = bytesize;
    String unit = "B";

    time_t modifiedTime = file.getLastWrite();

    if (filesize >= 1000000) {
        filesize /= 1000000.0;
        unit = "MB";
    } else if (filesize >= 1000) {
        filesize /= 1000.0;
        unit = "kB";
    }

    drawMainBorderWithTitle("FILE INFO");
    padprintln("");
    padprintln("Path: " + filepath);
    padprintln("");
    padprintf("Bytes: %d\n", bytesize);
    padprintln("");
    padprintf("Size: %.02f %s\n", filesize, unit.c_str());
    padprintln("");
    padprintf("Modified: %s\n", ctime(&modifiedTime));

    file.close();
    delay(100);

    while (!check(EscPress) && !check(SelPress)) { delay(100); }

    return;
}

/*********************************************************************
**  Function: createNewFile
**  Function will save a file into FS. If file already exists it will
**  append a version number to the file name.
**********************************************************************/
File createNewFile(FS *&fs, String filepath, String filename) {
    int extIndex = filename.lastIndexOf('.');
    String name = filename.substring(0, extIndex);
    String ext = filename.substring(extIndex);

    if (filepath.endsWith("/")) filepath = filepath.substring(0, filepath.length() - 1);
    if (!(*fs).exists(filepath)) (*fs).mkdir(filepath);

    name = filepath + "/" + name;

    if ((*fs).exists(name + ext)) {
        int i = 1;
        name += "_";
        while ((*fs).exists(name + String(i) + ext)) i++;
        name += String(i);
    }

    Serial.println("Creating file: " + name + ext);
    File file = (*fs).open(name + ext, FILE_WRITE);
    return file;
}

/*********************************************************************
**  Function: setupLeleFolders
**  Cria estrutura de pastas Lele no SD Card
**********************************************************************/
bool setupLeleFolders() {
    if (!setupSdCard()) {
        Serial.println("SD Card not mounted - cannot create Lele folders");
        return false;
    }

    const char *folders[] = {
        "/lele",
        "/lele/logs",
        "/lele/handshakes",
        "/lele/config",
        "/lele/captures",
        "/lele/scripts",
        "/lele/ir",
        "/lele/rf"
    };

    bool success = true;
    for (const char *folder : folders) {
        if (!SD.exists(folder)) {
            if (SD.mkdir(folder)) {
                Serial.printf("Created folder: %s\n", folder);
            } else {
                Serial.printf("Failed to create: %s\n", folder);
                success = false;
            }
        } else {
            Serial.printf("Folder exists: %s\n", folder);
        }
    }

    // Cria arquivo README.txt na pasta raiz lele
    if (!SD.exists("/lele/README.txt")) {
        File readme = SD.open("/lele/README.txt", FILE_WRITE);
        if (readme) {
            readme.println("=== Lele Origin ===");
            readme.println("");
            readme.println("Estrutura de pastas:");
            readme.println("  /logs       - Logs de ataques e operacoes");
            readme.println("  /handshakes - Capturas WiFi (PMKID, WPA)");
            readme.println("  /config     - Configuracoes e backups");
            readme.println("  /captures   - Capturas de pacotes");
            readme.println("  /scripts    - Scripts BadUSB e JS");
            readme.println("  /ir         - Arquivos IR");
            readme.println("  /rf         - Arquivos SubGHz");
            readme.close();
            Serial.println("Created /lele/README.txt");
        }
    }

    return success;
}
